# Tópicos Especiais em Processamento da Informação: Ciência de Dados

Prof. Luiz Affonso Guedes Engenharia de Computação - UFRN 2017-2

## Pacote Pandas

Pandas é construído sobre o Pacote Numpy. Porém, direntemente dos arrays de NumPy, variáveis manipuladas pelo Pandas podem ser de tipos diversos (não hogêgeos). Assim, uma determinada variável pode contém elementos de diversos tipos. DataFrame e Series são exemplos de dados complexo de Pandas. 

DataFrames são dados "retangulares", usualmente utilizados para representar informação em formato de planilha, por exemplo. Assim, as colunas devem ter as mesmas dimensões e cada coluna contém elementos de um mesmo tipo de dado.

Series são objetos tipo array uni-dimensional contendo um array de dados (equivalente ao array uni-dimensional NumPy) e um array de labels do array de dados (denominados de index da Serie). Na sua forma mais simples, Series podem conter apenas os arrays de dados. Neste caso, os indexes segue o padrão dos arrays NumPy (índices de zero a n-1).

Pandas implementa uma série de operações sobre dados para usuários familiarizados com banco de dados e planilhas.




Convensão de notação:
- from pandas import Series, DataFrame
- import pandas as pd

In [1]:
# Exemplo: Importanto Pandas

from pandas import Series, DataFrame
import pandas as pd

### Objeto do tipo Serie em Pandas

In [2]:
# Exemplo: criação de um objeto Pandas do tipo Series 
# - sem especificar os seus índices

dado = pd.Series([0.25, 0.5, 0.75, 1.0])
dado

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [3]:
# Exemplo: criação de um objeto Pandas do tipo Series 
# - sem especificar os seus índices

#obj_Serie = np.Series([4, 7, -5, 3])

obj_Serie = Series([4, 7, -5, 3])
print(obj_Serie)
type(obj_Serie)

0    4
1    7
2   -5
3    3
dtype: int64

pandas.core.series.Series

In [4]:
# Exemplo: Acessando valores de um objeto do tipo Serie - Pandas
print(obj_Serie.values)
type(obj_Serie.values)

[ 4  7 -5  3]

numpy.ndarray

In [5]:
# Exemplo: Acessando indexes de um objeto do tipo Serie - Pandas

print(obj_Serie.index)
type(obj_Serie.index)

RangeIndex(start=0, stop=4, step=1)

pandas.core.indexes.range.RangeIndex

Pelo que vimos até agora, pode-se parecer que o objeto Series é basicamente intercambiável com um array NumPy unidimensional. A diferença essencial é a presença do índice: enquanto o array NumPy possui um índice inteiro implícito definido para acessar os valores, a Serie Pandas possui um índice explicitamente definido associado aos valores.

Esta definição explícita de índice fornece recursos adicionais do objeto Series. Por exemplo, o índice não precisa ser um número inteiro, mas pode consistir em valores de qualquer tipo desejado. Por exemplo, se quisermos, podemos usar Strings como um índice.

In [7]:
# Exemplo: criação de um objeto pandas do tipo Series - Pandas
# - com especificação dos seus índices

obj_Serie2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
print(obj_Serie2)
print(obj_Serie2.index)
type(obj_Serie2.index)

d    4
b    7
a   -5
c    3
dtype: int64
Index(['d', 'b', 'a', 'c'], dtype='object')

pandas.core.indexes.base.Index

In [8]:
# Exemplo: Acessando elementos de Series via especificação do índice ou conjunto de índices
print("O acesso a elemento de Series é similar ao de arrays NumPy")
print(obj_Serie2['a'])
print(obj_Serie2[2])
print(obj_Serie2[-2])
print(obj_Serie2[['b', 'd', 'a']])

O acesso a elemento de Series é similar ao de arrays NumPy
-5
-5
-5
b    7
d    4
a   -5
dtype: int64

In [9]:
# Exemplo: filtros nos índices em Pandas são similares aos Arrays Numpy

obj_Serie2[obj_Serie2 > 0]

d    4
b    7
c    3
dtype: int64

In [10]:
# Exemplo: filtro nos índices de Arrays Numpy

import numpy as np
A = np.array([1, 4, 2, 5, 3])
A[A>2]

array([4, 5, 3])

In [11]:
# Exemplo: As operações preservam os índices dos objetos Series - Pandas
print(obj_Serie2*3)
print()
print(obj_Serie2**2)

d    12
b    21
a   -15
c     9
dtype: int64

d    16
b    49
a    25
c     9
dtype: int64

Também é  possível passar dados do tipo dictionaries como parâmetros para Series Pandas, como no exemplo abaixo.

In [12]:
# Exemplo de Series - Pandas usando tipos dictioneries

idadeD = {'Maria': 24, 'Pedro': 22, 'Mariana': 21, 'Joao': 20}
idadeSerie = Series(idadeD)
idadeSerie

Joao       20
Maria      24
Mariana    21
Pedro      22
dtype: int64

In [13]:
# Exemplo de Series - Pandas usando tipos dictionaries

idadeLista = ['Alice', 'Pedro', 'Mariana', 'Joao']
idadeSerie = Series(idadeD, index=idadeLista)
idadeSerie

Alice       NaN
Pedro      22.0
Mariana    21.0
Joao       20.0
dtype: float64

In [14]:
print("Por que o valor do índice Alice é NaN?, O que significa isto?")

Por que o valor do índice Alice é NaN?, O que significa isto?

In [15]:
# Execute este comando e verifique o resultado

idadeSerie.isnull()

Alice       True
Pedro      False
Mariana    False
Joao       False
dtype: bool

In [16]:
# Execute este comando e verifique o resultado

idadeSerie.notnull()

Alice      False
Pedro       True
Mariana     True
Joao        True
dtype: bool

### Dados não declarados - Data Missing
- indicar a falta de dados de diferentes maneiras.
- NaN (Not a Number).
- None.

Há diversos métodos em Pandas para tratar Data Missing.
- técnicas de eliminação
- técnicas de preenchimento

In [17]:
# Exemplo: Eliminando data missing

idadeSerie[idadeSerie.notnull()]

Pedro      22.0
Mariana    21.0
Joao       20.0
dtype: float64

In [18]:
# Exemplo: Eliminando data missing

idadeSerie

Alice       NaN
Pedro      22.0
Mariana    21.0
Joao       20.0
dtype: float64

In [19]:
# Exemplo: Eliminando data missing
idadeSerie.dropna()

Pedro      22.0
Mariana    21.0
Joao       20.0
dtype: float64

In [20]:
# Exemplo: Preenchimento de data missing
idadeSerie.fillna(-1)

Alice      -1.0
Pedro      22.0
Mariana    21.0
Joao       20.0
dtype: float64

In [21]:
# Operações sobre Series - Pandas

turmaLista1 = ['Alice', 'Pedro', 'Mariana', 'Joao']
turmaLista2 = ['Maria', 'Pedro', 'Mariana', 'Joao']

turmaSerie1 = Series([2,1,0.5,1], index=turmaLista1)
turmaSerie2 = Series([2,2,2,2], index=turmaLista2)

turmaSerie1 + turmaSerie2

Alice      NaN
Joao       3.0
Maria      NaN
Mariana    2.5
Pedro      3.0
dtype: float64

In [22]:
# Exemplo - Rotulando índices e nomes de Series - Pandas

turmaSerie1.name = 'Turma de Tópicos'
turmaSerie1.index.name = 'Alunos'
turmaSerie1

Alunos
Alice      2.0
Pedro      1.0
Mariana    0.5
Joao       1.0
Name: Turma de Tópicos, dtype: float64

Series Pandas podem ser vistas como o equivalente ao tipo básico dictionaries. Porém, assim como operações em arrays NumPy são mais eficientes que em Listas, operar em Series é bem mais eficiente que operarar sobre variáveis do tipo Dictonarie.

In [23]:
? Series

In [25]:
# Exemplo: População de alguns estados dos Estados Unidos

pop_dict = {'California': 38332521,
'Texas': 26448193,
'New York': 19651127,
'Florida': 19552860,
'Illinois': 12882135}
pop_dict

{'California': 38332521,
 'Florida': 19552860,
 'Illinois': 12882135,
 'New York': 19651127,
 'Texas': 26448193}

In [26]:
# Exemplo: Área de alguns estados dos Estados Unidos
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}
area_dict

{'California': 423967,
 'Florida': 170312,
 'Illinois': 149995,
 'New York': 141297,
 'Texas': 695662}

In [27]:
dict.values(pop_dict)

dict_values([38332521, 26448193, 19651127, 19552860, 12882135])

In [28]:
dict.keys(pop_dict)

dict_keys(['California', 'Texas', 'New York', 'Florida', 'Illinois'])

In [70]:
#Exercício: Transforme a variável dicionario 'pop_dict' em uma Serie-Pandas
#           - Obtenha os estados com mais de 20 milhões de habitantes.
#           - Obtenha o número de habitantes da California
#           - Obtenha o estado com mais habitantes
#           - Obtenha o estado com menos habitantes
#           - Obtenha a lista dos estados com área entre 400.000 e 500.000 
#           - A densidade (número de habitantes por área) desses estados

spop = Series(pop_dict)
print(spop)
print()
print('Mais de 20 milhoes: \n' + str(spop[spop>20000000]))
print()
print('Habitantes da california: '+ str(spop['California']))
print()
print('Estado com mais habitantes: ' + str(spop[(spop==spop.max())].index[0]))

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

Mais de 20 milhoes:
California    38332521
Texas         26448193
dtype: int64

Habitantes da california: 38332521

Estado com mais habitantes: California

Os Indexers: loc, iloc e ix
- indicação de índice específico. --> dado[3]
- indicação de intervalo de índices. --> dado[1:3]. Segue o padrão de Lista.
- métodos .loc(), .iloc() e  .ix()

In [71]:
# Exemplo de indicação de índice em Pandas

data = pd.Series(['a', 'b', 'c', 'd'], index=[1,3, 5, 7])
data

1    a
3    b
5    c
7    d
dtype: object

In [72]:
# Exemplo de indicação específica de índice em Pandas
data[1]
#data[0]

'a'

In [73]:
# Exemplo de indicação de intervalo de índice em Pandas
data[1:3]
#data[0:2]

3    b
5    c
dtype: object

In [74]:
# Exemplo de indicação de índice em Pandas usando o método .loc()
print(data.loc[1])
print()
print(data.loc[1:3])

a

1    a
3    b
dtype: object

In [75]:
# Exemplo de indicação de índice em Pandas usando o método .iloc()
print(data.iloc[1])
print()
print(data.iloc[1:3])

b

3    b
5    c
dtype: object

In [76]:
# Exemplo de indicação de índice em Pandas usando o método .iloc()
print(data.ix[1])
print()
print(data.ix[1:3])

a

1    a
3    b
dtype: object

/opt/Anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

### Objeto do tipo DataFrame em Pandas

Se uma Serie-Pandas é um análogo de um array NumPy unidimensional com índices explícitos e flexíveis, então um DataFrame é um análogo de array NumPy bidimensional com índices de linha e de colunas flexíveis.

Assim, DataFrame Pandas equivale a uma Matriz com índices explícitos, porém, diferentemenete dos arrays NumPy, os elementos podem ser de tipos diferentes.

DataFrames podem ser vistos como uma sequência de objetos Series-Pandas alinhados por índices.

In [77]:
# Exemplo - Transformação de dict em Serie-Pandas
populacao = pd.Series(pop_dict)
populacao

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
dtype: int64

In [78]:
# Exemplo - Transformação de dict em Serie-Pandas
area = pd.Series(area_dict)
area

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
dtype: int64

In [79]:
# Exemplo - Criação de um DataFrame Pandas

estados = pd.DataFrame({'população': populacao,'área': area})
estados

            população    área
California   38332521  423967
Florida      19552860  170312
Illinois     12882135  149995
New York     19651127  141297
Texas        26448193  695662

In [80]:
type(estados)

pandas.core.frame.DataFrame

In [81]:
estados.index

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [82]:
estados.columns

Index(['população', 'área'], dtype='object')

Da mesma forma, também podemos pensar em um DataFrame como uma especialização de um dicionário. Onde um dicionário mapeia uma chave para um valor, um DataFrame mapeia um nome de coluna para uma série de dados de coluna. Por exemplo, pedir o atributo 'área' retorna o objeto Series que contém as áreas que vimos anteriormente:

In [83]:
estados['área']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: área, dtype: int64

DataFrame Pandas podem ser criados de diversas formas.
- A partir de objetos Series
- A partir de Listas de Dicionários
- A partir de Dicionários de objetos Series
- A partir de arrays NumPy bidimensionais
- A partir de array NumPy estruturado

In [84]:
# Exemplo: Criação de DataFrame Pandas a partir de objetos Series
pd.DataFrame(populacao, columns=['população'])

            população
California   38332521
Florida      19552860
Illinois     12882135
New York     19651127
Texas        26448193

In [85]:
# Exemplo: Criação de DataFrame Pandas a partir de Lista de Dicionário
data = [{'a': i, 'b': 2 * i} for i in range(3)]
pd.DataFrame(data)
#data

   a  b
0  0  0
1  1  2
2  2  4

In [89]:
# Exemplo: Criação de DataFrame Pandas a partir de Lista de Dicionário
# Data Missing (Dados perdidos) - similar ao objeto Serie

a = pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])
a

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [93]:
# Exercício: Troque os índices do DataFrame Acima
#            para linha1 e linha2, respecitvamente
print(a)
pd.DataFrame(a.values,['linha1','linha2'])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

          0    1    2
linha1  1.0  2.0  NaN
linha2  NaN  3.0  4.0

#### Tratando Data Missing em DataFrame
De forma similar a Series, podemos tratar data missing em DataFrame
- técnicas de eliminação
    - df.dropna(parametros)
- técnicas de preenchimento
    - df.fillna(parametros)

In [94]:
# Exemplo: Eliminando data missing em DataFrames
# Eliminar as linhas com NaN
# Eliminar as colunas com NaN
# Eliminar as linhas e colunas com NaN

df = pd.DataFrame([[1, np.nan, 2],
[2, 3, 5],
[np.nan, 4, 6]])
print("df com NaN \n", df)

print("\n df sem NaN - com eliminação de linhas \n", df.dropna())

print("\n df sem NaN - com eliminação de colunas \n", df.dropna(axis='columns'))

df com NaN
      0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

 df sem NaN - com eliminação de linhas
      0    1  2
1  2.0  3.0  5

 df sem NaN - com eliminação de colunas
    2
0  2
1  5
2  6

In [95]:
# Exemplo: Eliminando data missing em DataFrames
# Eliminar as linhas com NaN
# Eliminar as colunas com NaN
# Eliminar as linhas e colunas com NaN

dataF = DataFrame([[1., 6.5, 3.], [1., None, None], [None, None, None], [None, 6.5, 3.]])
dataF

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [96]:

dataF.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [97]:
# Exemplo: Preenchimento de data missing em DataFrames
df = DataFrame(np.random.randn(7, 3))
df

          0         1         2
0 -0.979549  1.154628 -0.663579
1 -1.628033 -1.440529 -0.646968
2 -0.619182 -0.342432 -0.142772
3 -0.452183  0.243688 -0.072036
4 -0.898461  1.293115  0.587564
5 -1.392622 -0.483193 -0.599785
6  0.342141 -0.648618 -0.214851

In [98]:
df.ix[:4, 1] = None; df.ix[:2, 2] = None
df

/opt/Anaconda/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          0         1         2
0 -0.979549       NaN       NaN
1 -1.628033       NaN       NaN
2 -0.619182       NaN       NaN
3 -0.452183       NaN -0.072036
4 -0.898461       NaN  0.587564
5 -1.392622 -0.483193 -0.599785
6  0.342141 -0.648618 -0.214851

In [99]:
# Exemplo: Preenchimento de data missing em DataFrames
#          com valor ZERO

df.fillna(0)

          0         1         2
0 -0.979549  0.000000  0.000000
1 -1.628033  0.000000  0.000000
2 -0.619182  0.000000  0.000000
3 -0.452183  0.000000 -0.072036
4 -0.898461  0.000000  0.587564
5 -1.392622 -0.483193 -0.599785
6  0.342141 -0.648618 -0.214851

In [100]:
df.iloc[3:4,0:1] = None
df

          0         1         2
0 -0.979549       NaN       NaN
1 -1.628033       NaN       NaN
2 -0.619182       NaN       NaN
3       NaN       NaN -0.072036
4 -0.898461       NaN  0.587564
5 -1.392622 -0.483193 -0.599785
6  0.342141 -0.648618 -0.214851

In [101]:
# Exemplo: Preenchimento de data missing em DataFrames
df.fillna(method='ffill')

          0         1         2
0 -0.979549       NaN       NaN
1 -1.628033       NaN       NaN
2 -0.619182       NaN       NaN
3 -0.619182       NaN -0.072036
4 -0.898461       NaN  0.587564
5 -1.392622 -0.483193 -0.599785
6  0.342141 -0.648618 -0.214851

In [102]:
# Exemplo: Preenchimento de data missing em DataFrames
# Chamendo .fillna() com um tipo 'dict', 
# pode-se usar um valor diferente de preenchimento para cada coluna

df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.979549  0.500000       NaN
1 -1.628033  0.500000       NaN
2 -0.619182  0.500000       NaN
3       NaN  0.500000 -0.072036
4 -0.898461  0.500000  0.587564
5 -1.392622 -0.483193 -0.599785
6  0.342141 -0.648618 -0.214851

In [103]:
# Exemplo: Criação de DataFrame Pandas 
#          a partir Dicionários de objetos Series

pd.DataFrame({'população1': populacao,'área1': area})

            população1   área1
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

In [104]:
# Exemplo: Criação de DataFrame Pandas 
#          a partir de arrays NumPy bidimensionais

import numpy as np

pd.DataFrame(np.random.rand(3, 2),
             columns=['coluna 1', 'coluna 2'],
             index=['linha 1', 'linha 2', 'linha 3'])

         coluna 1  coluna 2
linha 1  0.709445  0.494195
linha 2  0.196128  0.220721
linha 3  0.635143  0.138427

In [105]:
# Exemplo: Criação de DataFrame Pandas 
#          a partir de array NumPy estruturado
Resultado = np.zeros(3, dtype=[('A', 'i8'), ('B', 'f8')])
Resultado

array([(0,  0.), (0,  0.), (0,  0.)],
      dtype=[('A', '<i8'), ('B', '<f8')])

In [106]:
pd.DataFrame(Resultado)

   A    B
0  0  0.0
1  0  0.0
2  0  0.0

A seguir, são apresentados alguns exemplos de como acessar DataFrames e elementos de DataFrames

In [107]:
estados

            população    área
California   38332521  423967
Florida      19552860  170312
Illinois     12882135  149995
New York     19651127  141297
Texas        26448193  695662

In [108]:
estados['área']

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: área, dtype: int64

In [110]:
estados[['área','população']]

              área  população
California  423967   38332521
Florida     170312   19552860
Illinois    149995   12882135
New York    141297   19651127
Texas       695662   26448193

In [109]:
estados.área

California    423967
Florida       170312
Illinois      149995
New York      141297
Texas         695662
Name: área, dtype: int64

Incluir e modificar colunas no DataFrame Pandas
- uma das formas, pode ser usando uma sintaxe similar à de dicionários com objetos Series Pandas.

In [111]:
# Exemplo - Inclusão de uma nova coluna no DataFrame Pandas

estados['densidade'] = estados['população'] / estados['área']
estados

            população    área   densidade
California   38332521  423967   90.413926
Florida      19552860  170312  114.806121
Illinois     12882135  149995   85.883763
New York     19651127  141297  139.076746
Texas        26448193  695662   38.018740

Como DataFrames podem ser arrays bidimensionais, podemos utilizar operações a esses.

In [112]:
# Exemplo - Como inverter a representação do DataFrame Pandas
estados.T

,California,Florida,Illinois,New York,Texas
população,3.833252e+07,1.955286e+07,1.288214e+07,1.965113e+07,2.644819e+07
área,4.239670e+05,1.703120e+05,1.499950e+05,1.412970e+05,6.956620e+05
densidade,9.041393e+01,1.148061e+02,8.588376e+01,1.390767e+02,3.801874e+01

In [113]:
# Exemplo - Obtendo índicers de DataFrames Pandas
estados.values

array([[  3.83325210e+07,   4.23967000e+05,   9.04139261e+01],
       [  1.95528600e+07,   1.70312000e+05,   1.14806121e+02],
       [  1.28821350e+07,   1.49995000e+05,   8.58837628e+01],
       [  1.96511270e+07,   1.41297000e+05,   1.39076746e+02],
       [  2.64481930e+07,   6.95662000e+05,   3.80187404e+01]])

In [114]:
# Exemplo - Obtendo índices de DataFrames Pandas
estados.values[0]

array([  3.83325210e+07,   4.23967000e+05,   9.04139261e+01])

In [115]:
# Exemplo - Obtendo índicers de DataFrames Pandas
estados.values[:][0]

array([  3.83325210e+07,   4.23967000e+05,   9.04139261e+01])

In [116]:
estados[estados.densidade > 100]

          população    área   densidade
Florida    19552860  170312  114.806121
New York   19651127  141297  139.076746

In [ ]:
# Exercício: Liste o atributo 'densidade'
#           dos estados da Florida e Illinois

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# O método .iloc() pemite acesso por numeração - localicação

estados.iloc[:3, :2]

#estados[:3,:2]

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# O método .loc() permite acesso por labels

estados.loc[:'Illinois', :'população']

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# O método .ix() permite acesso por numeração e label

estados.ix[:3, :'população']

In [ ]:
estados

In [ ]:
# Exemplo de listagem de sub-DataFrame em Pandas
# Uso do estilo NumPy para acessar sub Arrays
# Formato:
# dataFrame.loc[LINHAS, COLUNAS]

estados.loc[estados.densidade > 100, ['população', 'densidade']]

In [ ]:
# Exercício: 
# Obenha apenas os Estados com população acima de 20 milhões.
# Exiba as colunas 'população'e 'densidade'

Métodos:
    - pd.head(x)  --> lista as x primeiras linhas do DataFrame
    - pd.tail(x)  --> lista as x últimas linhas do DataFrame
    - pd.info()   --> resume o conteúdo do DataFrame

In [117]:
# Exemplo de uso do método pd.head()
estados.head(2)
#estados.head()

            população    área   densidade
California   38332521  423967   90.413926
Florida      19552860  170312  114.806121

In [118]:
# Exemplo de uso do método pd.tail()
estados.tail(2)
#estados.tail()

          população    área   densidade
New York   19651127  141297  139.076746
Texas      26448193  695662   38.018740

In [119]:
# Exemplo de uso do método pd.info()
estados.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, California to Texas
Data columns (total 3 columns):
população    5 non-null int64
área         5 non-null int64
densidade    5 non-null float64
dtypes: float64(1), int64(2)
memory usage: 320.0+ bytes

Como se pode alterar os valores de elementos de DataFrames?

In [ ]:
# Verifique uma forma de alterar valores de elementos do DataFrame estados

Pandas foi desenvolvido sobre o NumPy e manteve a compatibilidade das operações NumPy.
- dados Pandas (Series, DataFrame) aceitam as operações NumPy

In [120]:
# Exemplo de operação NumPy sobre dados Pandas
# Definindo o objeto ser - Tipo Series Pandas
import pandas as pd
import numpy as np

rng = np.random.RandomState(42)
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [121]:
# Exemplo de operação NumPy sobre dados Pandas
# Operação exponencial sobre um objeto Series Pandas

np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [122]:
# Exemplo de operação NumPy sobre dados Pandas
# Definindo o objeto df - Tipo DataFrame Pandas

df = pd.DataFrame(rng.randint(0, 10, (3, 4)),
columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  6  9  2  6
1  7  4  3  7
2  7  2  5  4

In [123]:
# Exemplo de operação NumPy sobre dados Pandas
# Operação seno sobre um objeto DataFrame Pandas

np.sin(df * np.pi / 4)

          A             B         C             D
0 -1.000000  7.071068e-01  1.000000 -1.000000e+00
1 -0.707107  1.224647e-16  0.707107 -7.071068e-01
2 -0.707107  1.000000e+00 -0.707107  1.224647e-16

Alinhamento de índices em Pandas:

Para operações binárias em dois objetos Series ou DataFrame, Pandas alinhará índices no processo de execução da operação. Isso é muito conveniente quando você está trabalhando com dados incompletos, como veremos em alguns dos exemplos que se seguem.

In [124]:
# Exemplo: Alinahmento automático de índices em Pandas
# Criação das Series Pandas - area e population

area = pd.Series({'Alaska': 1723337, 'Texas': 695662,
'California': 423967}, name='área')

population = pd.Series({'California': 38332521, 'Texas': 26448193,
'New York': 19651127}, name='população')


# Pandas irá completar com NaN os dados incompletos (data missing)
population / area

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

O Array resultante é a união união de índices dos dois arrays de entrada.
- Equivale a fazer a união explícita no padrão Python:
    - area.index | population.index
- Os índices resultantes da união que não tiverem entradas são marcados com NaN (data missing).

In [125]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [126]:
# Exemplo de alinhamento automático em Pandas

A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [127]:
# Exemplo: Similar ao exemplo anterior, 
#          mas preenchendo os data missing com valor ZERO
# Uso do estilo de operadores-métodos no NumPY

A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

Métodos de operadores binários em Pandas 
- add() --> Adição
- sub(), subtract() --> Subtração
- mul(), multiply() --> Multiplicação
- truediv(), div(), divide() --> Divição
- floordiv()  --> (parte inteira da divisão)
- % mod()     ---> (resto da divisão)
- pow()   --> potência

Exercício: Escreva o seguinte programa
    - df1 - Dataframe com 3 linhas e 2 colunas (col1, col2). Inicie o DataFrame de forma ra
    - df2 - Dataframe com 2 linhas e 3 colunas (col1, col2, col3)
    - df3 = df1 + df2
    - df4 = df1 / df2
    - o quadrado de df1
    - Inicie os DataFrames df1 e df2 de forma randômica.

In [ ]:
# Exercício:

Não podemos esquecer que operações sobre Series e DataFrames Pandas opera por linhas, como nos arrays NumPy.

In [128]:
# Criação de um Array NumPy

A = rng.randint(10, size=(3, 4))
A

array([[1, 7, 5, 1],
       [4, 0, 9, 5],
       [8, 0, 9, 2]])

In [ ]:
# Operação por linha entre arrays NumPy
A - A[0]

In [129]:
# Criação de uma DataFrame Pandas

df = pd.DataFrame(A, columns=list('QRST'))
df

   Q  R  S  T
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [130]:
# Operação por linha com DataFrame Pandas

df - df.iloc[0]

   Q  R  S  T
0  0  0  0  0
1  3 -7  4  4
2  7 -7  4  1

In [131]:
# Operação de subtração por coluna sobre DataFrame Pandas

df.subtract(df['R'], axis=0)

   Q  R  S  T
0 -6  0 -2 -6
1  4  0  9  5
2  8  0  9  2

In [132]:
# Exercício
# Explique o que a linha de código abaixo executa.

halfrow = df.iloc[0, ::2]
halfrow
#df - halfrow

Q    1
S    5
Name: 0, dtype: int64

Exemplo de concatenação de Series e DataFrames Pandas

In [133]:
# Concatenação de Series Pandas

ser1 = pd.Series(['A', 'B', 'C'], index=[1, 2, 3])
ser2 = pd.Series(['D', 'E', 'F'], index=[4, 5, 6])
pd.concat([ser1, ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [135]:
# Função para preencher um DataFrame Pandas

def make_df(cols, ind):
  data = {c: [str(c) + str(i) for i in ind]
  for c in cols}
  return pd.DataFrame(data, ind)

# exemplo de uso da função DataFrame
make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [137]:
# Concatenação de DataFrames Pandas

df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])
print(df1);
print()
print(df2)
print()
print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2

    A   B
3  A3  B3
4  A4  B4

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [138]:
# Anexação de DataFrame Pandas

print(df1.append(df2))

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

#### Objeto Index em Pandas
É uma classe em Pandas que possui métodos próprios para operar sobre os índices de objetos Pandas, como Series e DataFrames.
Index pode ser:
- Array imutável
- Conjunto ordenado

In [140]:
# Criação de um objeto Index como Array Imutável
# No caos, uma lista de inteiros

ind = pd.Index([2, 3, 5, 7, 11])
print(ind)
print(ind[1])
print(ind[::2])
print("\nObjeto Index possui métodos similares aos dos arrays NumPy")
print(ind.size, ind.shape, ind.ndim, ind.dtype)

Int64Index([2, 3, 5, 7, 11], dtype='int64')
3
Int64Index([2, 5, 11], dtype='int64')

Objeto Index possui métodos similares aos dos arrays NumPy
5 (5,) 1 int64

In [141]:
# Index não podem ser modificados - Eles são imutáveis
nd[1] = 0

NameError: name 'nd' is not defined

In [ ]:
# Criação de um objeto Index conjunto ordenado

In [142]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])

print("interseção --> ", indA & indB)

print("união -->  ", indA | indB)

print("diferença simétrica --> ",  indA ^ indB)

interseção -->  Int64Index([3, 5, 7], dtype='int64')
união -->   Int64Index([1, 2, 3, 5, 7, 9, 11], dtype='int64')
diferença simétrica -->  Int64Index([1, 2, 9, 11], dtype='int64')

## Carregar, armazenar e formatar DataFrames

### Métodos para carregar/ler/importar dados tipo DataFrame Pandas

Pandas possui vários métodos para ler dados tabulados.
- pd.read_csv('arquivo.csv', parametros). Carrega dado com formato .csv delimitado a partir de um arquivo, URL ou objeto tipo arquivo. Usa vígula como delimitador padrão.


- pd.read_table(árquivo.txt', parametros) -  Carrega dado delimitado a partir de arquivo, URL, ou objeto tipo arquivo. Usa tab ('\t') como delimitador padrão.

In [143]:
teste1 = pd.read_csv('ScoobyDoo.csv')

In [144]:
teste1

       nome  idade
0    Scooby     10
1  Salsicha     18
2      Fred     20
3     Velma     21
4    Daphne     19

In [146]:
teste2 = pd.read_csv('ScoobyDoo.csv', header=None)

In [147]:
teste2

          0      1
0      nome  idade
1    Scooby     10
2  Salsicha     18
3      Fred     20
4     Velma     21
5    Daphne     19

In [148]:
# Exemplo: Obtendo informação do DataFrame
teste1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
nome     5 non-null object
idade    5 non-null int64
dtypes: int64(1), object(1)
memory usage: 160.0+ bytes

In [149]:
teste3 = pd.read_csv('ScoobyDoo.csv', names=['Coluna 1', 'Coluna 2'])
teste3

   Coluna 1 Coluna 2
0      nome    idade
1    Scooby       10
2  Salsicha       18
3      Fred       20
4     Velma       21
5    Daphne       19

Exemplos de algumas possibilidades de cálculo com DataFrame

In [150]:
teste1['idade'].sum()

88

In [151]:
teste1['idade']>19

0    False
1    False
2     True
3     True
4    False
Name: idade, dtype: bool

In [158]:
# Exercício: Inclua uma coluna 'Sexo'no DataFrame teste1
# Atribua o sexeo adequadamente para os personagens 
# ('M'- masculino, 'F' - Feminino')
# Calcule a média de idade dos personagens femininos
teste1['sexo'] =  ['M','f','m','f','f']
teste1

       nome  idade sexo
0    Scooby     10    M
1  Salsicha     18    f
2      Fred     20    m
3     Velma     21    f
4    Daphne     19    f

In [ ]:
# Exercício: Inclua uma coluna 'Peso' no DataFrame teste1
# Scooby - 40 kg
# Salsicha - 55 kg
# Fred  - 70 Kg
# 
# Velma = None
# Daphne = 50 Kg

In [ ]:
# Exercício: Inclua uma coluna 'Altura' no DataFrame teste1
# Scooby - 1.5m
# Salsicha - 1.75m
# Fred  - 1.80m
# 
# Velma = 1.60m
# Daphne = 1.65m

In [ ]:
# Exercício: Inclua uma coluna 'IMC' no DataFrame teste1
# Preencha essa coluna com o valor de Índice de Massa Corporea dos personagens
# Obtenha o personagem que tem a menor IMC

### Lendo arquivos via URL

In [230]:
# arquivo do GitHub - Livro Handbook of data Science
Estados_USA = pd.read_csv('https://raw.githubusercontent.com/jakevdp/PythonDataScienceHandbook/master/notebooks/data/state-population.csv')

In [231]:
Estados_USA

     state/region     ages  year   population
0              AL  under18  2012    1117489.0
1              AL    total  2012    4817528.0
2              AL  under18  2010    1130966.0
3              AL    total  2010    4785570.0
4              AL  under18  2011    1125763.0
5              AL    total  2011    4801627.0
6              AL    total  2009    4757938.0
7              AL  under18  2009    1134192.0
8              AL  under18  2013    1111481.0
9              AL    total  2013    4833722.0
10             AL    total  2007    4672840.0
11             AL  under18  2007    1132296.0
12             AL    total  2008    4718206.0
13             AL  under18  2008    1134927.0
14             AL    total  2005    4569805.0
15             AL  under18  2005    1117229.0
16             AL    total  2006    4628981.0
17             AL  under18  2006    1126798.0
18             AL    total  2004    4530729.0
19             AL  under18  2004    1113662.0
20             AL    total  2003    4503491.0
21             AL  under18  2003    1113083.0
22             AL    total  2001    4467634.0
23             AL  under18  2001    1120409.0
24             AL    total  2002    4480089.0
25             AL  under18  2002    1116590.0
26             AL  under18  1999    1121287.0
27             AL    total  1999    4430141.0
28             AL    total  2000    4452173.0
29             AL  under18  2000    1122273.0
...           ...      ...   ...          ...
2514          USA  under18  1999   71946051.0
2515          USA    total  2000  282162411.0
2516          USA  under18  2000   72376189.0
2517          USA    total  1999  279040181.0
2518          USA    total  2001  284968955.0
2519          USA  under18  2001   72671175.0
2520          USA    total  2002  287625193.0
2521          USA  under18  2002   72936457.0
2522          USA    total  2003  290107933.0
2523          USA  under18  2003   73100758.0
2524          USA    total  2004  292805298.0
2525          USA  under18  2004   73297735.0
2526          USA    total  2005  295516599.0
2527          USA  under18  2005   73523669.0
2528          USA    total  2006  298379912.0
2529          USA  under18  2006   73757714.0
2530          USA    total  2007  301231207.0
2531          USA  under18  2007   74019405.0
2532          USA    total  2008  304093966.0
2533          USA  under18  2008   74104602.0
2534          USA  under18  2013   73585872.0
2535          USA    total  2013  316128839.0
2536          USA    total  2009  306771529.0
2537          USA  under18  2009   74134167.0
2538          USA  under18  2010   74119556.0
2539          USA    total  2010  309326295.0
2540          USA  under18  2011   73902222.0
2541          USA    total  2011  311582564.0
2542          USA  under18  2012   73708179.0
2543          USA    total  2012  313873685.0

[2544 rows x 4 columns]

### Salvando DataFrames como arquivos .csv, .xlx, etc

In [152]:
teste1.to_csv('teste4.csv')

In [ ]:
#dataF.to_excel('nome_do_arquivo.xlsx', index=False)